app/Controllers/Anggota.php

SELECT *
FROM `anggota`
---
   public function index() {
    $data = [
        'title'   => 'Data Anggota',
        // Ambil semua kolom termasuk username
        'anggota' => $this->db->table('anggota')->select('*')->get()->getResultArray()

SELECT *
FROM `anggota`
WHERE `id_anggota` = '24'
---
    public function profile()
{
    $db = \Config\Database::connect();
    // Ambil ID dari session yang login
    $id = session()->get('id_anggota');

    $data = [
        'title'   => 'Profil Saya',
        'anggota' => $db->table('anggota')->where('id_anggota', $id)->get()->getRowArray()