app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'adut'
 LIMIT 1
SELECT *
FROM `anggota`
WHERE `username` = 'adut'
---
    public function prosesLogin()
    {
        $db = \Config\Database::connect();
        $model = new UsersModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // 1. CEK DI TABEL USERS (ADMIN/PETUGAS)
        $user = $model->where('username', $username)->first();

        if ($user) {
            if (password_verify($password, $user['password'])) {
                $fixRole = ucfirst(strtolower($user['role']));
                session()->set([
                    'id_user'   => $user['id_user'] ?? $user['id'],
                    'username'  => $user['username'],
                    'nama'      => $user['nama'],
                    'role'      => $fixRole,
                    'foto'      => $user['foto'] ?? 'default.png',
                    'logged_in' => true
                ]);
                return redirect()->to('/dashboard');
            } else {
                return redirect()->back()->with('error', 'Password Admin Salah');
            }
        }

        // 2. CEK DI TABEL ANGGOTA (KALAU DI USERS GAK ADA)
        $anggota = $db->table('anggota')->where('username', $username)->get()->getRowArray();