app/Controllers/Buku.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $builder = $this->db->table('buku');
        $builder->select('buku.*, kategori.nama_kategori, penulis.nama_penulis, penerbit.nama_penerbit, rak.nama_rak, rak.lokasi');
        $builder->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left');
        $builder->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left');
        $builder->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left');
        $builder->join('buku_rak', 'buku_rak.id_buku = buku.id_buku', 'left');
        $builder->join('rak', 'rak.id_rak = buku_rak.id_rak', 'left');

        if ($keyword) {
            $builder->like('buku.judul', $keyword);
        }

        $data['buku'] = $builder->get()->getResultArray();
---
SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`, `rak`.`lokasi`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`

    public function edit($id)
    {
        $buku = $this->db->table('buku')
            ->select('buku.*, buku_rak.id_rak')
            ->join('buku_rak', 'buku_rak.id_buku = buku.id_buku', 'left')
            ->where('buku.id_buku', $id)
            ->get()->getRowArray();

        $data = [
            'title'    => 'Edit Buku',
            'buku'     => $buku,
            'kategori' => $this->kategoriModel->findAll(),
            'penulis'  => $this->penulisModel->findAll(),
            'penerbit' => $this->penerbitModel->findAll(),
---
SELECT `buku`.*, `buku_rak`.`id_rak`
FROM `buku`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
WHERE `buku`.`id_buku` = '1'
SELECT *
FROM `kategori`
SELECT *
FROM `penulis`
SELECT *
FROM `penerbit`