app/Controllers/Home.php

    public function index()
    {
        // 1. Ambil data session
        $id_login = session()->get('id_users');
        $role     = session()->get('role');

        // Cek jika belum login
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        // 2. Koneksi Database & Model
        $db         = \Config\Database::connect();
        $logModel   = new LogModel();
        $bukuModel  = new BukuModel();
        $usersModel = new UsersModel();

        // 3. Logika Log Aktivitas
        $cekRole = strtolower($role);
        if ($cekRole == 'admin' || $cekRole == 'petugas') {
            $logs = $logModel->orderBy('id_log', 'DESC')->findAll();
        } else {
            $logs = $logModel->where('id_users', $id_login)
                             ->orderBy('id_log', 'DESC')
                             ->findAll();
        }

        // 4. Siapkan SEMUA variabel
        $data = [
            'title'           => 'Dashboard',
            'logs'            => $logs,
            'total_buku'      => $bukuModel->countAllResults(),
            'total_anggota'   => $db->table('anggota')->countAllResults(),
            'total_pinjam'    => $db->table('peminjaman')->countAllResults(),

            // PERBAIKAN DI SINI: Sesuaikan dengan status di database (di pinjam)
            'sirkulasi_aktif' => $db->table('peminjaman')
                                   ->where('status', 'di pinjam')
                                   ->countAllResults(),

            'users'           => $usersModel->findAll(),
        ];
---
SELECT *
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'di pinjam'
SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `anggota`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`