app/Controllers/Peminjaman.php

SELECT `denda`.*, `anggota`.`nama_anggota`, `buku`.`judul`
FROM `denda`
JOIN `pengembalian` ON `pengembalian`.`id_pengembalian` = `denda`.`id_pengembalian`
JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `pengembalian`.`id_peminjaman`
JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
---
    public function list_denda()
    {
        $db = \Config\Database::connect();
        $queryDenda = $db->table('denda')
            ->select('denda.*, anggota.nama_anggota, buku.judul')
            ->join('pengembalian', 'pengembalian.id_pengembalian = denda.id_pengembalian')
            ->join('peminjaman', 'peminjaman.id_peminjaman = pengembalian.id_peminjaman')
            ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku')
            ->get()
            ->getResultArray();

SELECT `denda`.*, `buku`.`judul`, `anggota`.`nama_anggota`
FROM `denda`
JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `denda`.`id_pengembalian`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
---
    public function konfirmasi_bayar($id)
    {
        $dataDenda = $this->dendaModel->find($id);

        // 1. Update denda jadi lunas
        $this->dendaModel->update($id, [
            'status' => 'lunas',
            'tgl_pembayaran' => date('Y-m-d')
        ]);

        // 2. Update status pengembalian jadi Selesai
        $db = \Config\Database::connect();
        $db->table('pengembalian')
           ->where('id_pengembalian', $dataDenda['id_pengembalian'])
          ->update(['status' => 'Selesai']); // GANTI 'status_kembali' JADI 'status'

        return redirect()->back()->with('success', 'Denda lunas & pengembalian buku selesai!');