app/Controllers/Peminjaman.php

    public function delete($id = null)
    {
        $db = \Config\Database::connect();
        $db->table('peminjaman')->where('id_peminjaman', $id)->delete();
---
DELETE FROM `peminjaman`
WHERE `id_peminjaman` IN ('29')

    public function list_denda()
{
    $db = \Config\Database::connect();

    // Ambil keyword kalau ada pencarian
    $keyword = $this->request->getGet('keyword');
    $builder = $db->table('denda')
        ->join('peminjaman', 'peminjaman.id_peminjaman = denda.id_pengembalian')
        ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota')
        ->join('buku', 'buku.id_buku = peminjaman.id_buku')
        ->select('denda.*, anggota.nama_anggota, buku.judul');

    if ($keyword) {
        $builder->like('anggota.nama_anggota', $keyword)
                ->orLike('buku.judul', $keyword);
    }

    $data['denda'] = $builder->get()->getResultArray();
---
SELECT `denda`.*, `anggota`.`nama_anggota`, `buku`.`judul`
FROM `denda`
JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `denda`.`id_pengembalian`
JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`