app/Controllers/Users.php

    public function index()
    {
        $data = [
            'users' => $this->users->findAll()
        ];
---
SELECT *
FROM `users`

    public function update($id)
    {
        $userLama = $this->users->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'