app/Models/PeminjamanModel.php

 public function getPeminjaman() {
    return $this->db->table('peminjaman')
        ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota')
        ->join('buku', 'buku.id_buku = peminjaman.id_buku')
        ->get()->getResultArray();
---
SELECT `peminjaman`.*, `anggota`.`nama_anggota`, `buku`.`judul`
FROM `peminjaman`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
LEFT JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`